{
  "backend/main.mo": "Defines the game canister with room state, phases, players, chats, topics, guesses, and all core logic for creating/joining rooms and managing gameplay.",
  "backend/migration.mo": "Provides migration logic converting old room state to new state by adding the roundNumber field with a default value.",
  "feature_evidence.json": "Lists feature evidence entries linking product requirements to specific frontend files and components for validation.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of all frontend files for documentation and build reference.",
  "frontend/index.css": "Defines Tailwind base layers and custom CSS variables for theming in light and dark modes.",
  "frontend/index.html": "Root HTML file loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Main React component that routes between game screens based on session state and backend phase updates.",
  "frontend/src/echoshift/api/useCheckAndAdvancePhase.ts": "React Query mutation hook that calls backend to advance the game phase and refreshes room state.",
  "frontend/src/echoshift/api/useCreateRoom.ts": "Mutation hook for creating a room, generating a code, updating session state, and handling success/error toasts.",
  "frontend/src/echoshift/api/useJoinRoom.ts": "Mutation hook for joining an existing room with error handling for missing, full, or invalid rooms.",
  "frontend/src/echoshift/api/usePlayAgain.ts": "Mutation hook that resets the room for a new round and refreshes room state.",
  "frontend/src/echoshift/api/useRoomState.ts": "Polling query hook fetching room state from the backend every two seconds.",
  "frontend/src/echoshift/api/useSendMessage.ts": "Provides a mutation to send a chat message and refresh room state on success, with error toasts.",
  "frontend/src/echoshift/api/useStartGame.ts": "Creates a mutation to start the game, handling host/size errors and invalidating room state.",
  "frontend/src/echoshift/api/useSubmitGuess.ts": "Submits guess objects for selected players and refreshes room state afterward.",
  "frontend/src/echoshift/api/useVoteForTopic.ts": "Sends a topic vote mutation using the actor and refreshes room state.",
  "frontend/src/echoshift/components/AppHeader.tsx": "Renders a page header showing title, optional subtitle, username badge, and room code.",
  "frontend/src/echoshift/components/ChatComposer.tsx": "Input form for typing and sending chat messages with basic validation.",
  "frontend/src/echoshift/components/ChatMessageList.tsx": "Displays chat messages with auto-scroll and timestamp formatting, highlighting the current user.",
  "frontend/src/echoshift/components/ErrorBanner.tsx": "Shows a destructive alert banner with an error title and message.",
  "frontend/src/echoshift/components/ScreenLayout.tsx": "Provides a page layout with centered content and a footer linking to caffeine.ai.",
  "frontend/src/echoshift/hooks/useChatCountdown.ts": "Computes remaining chat time based on room state start time and exposes formatted countdown info.",
  "frontend/src/echoshift/identity/playerId.ts": "Generates and persists a unique player ID in localStorage.",
  "frontend/src/echoshift/identity/useLocalUsername.ts": "Ensures a local username exists by generating one and allows resetting it.",
  "frontend/src/echoshift/identity/username.ts": "Generates adjective–animal usernames with numbers and validates their pattern.",
  "frontend/src/echoshift/screens/GameChatScreen.tsx": "Shows the chat phase UI with timer, topic, role info, message list, and composer, advancing phase when time expires.",
  "frontend/src/echoshift/screens/GuessingScreen.tsx": "Displays the guessing phase where the Anchor selects players to mark as weird and submits guesses.",
  "frontend/src/echoshift/screens/HomeScreen.tsx": "Home screen letting users view/reset username, create a room, or join via code while ensuring a player ID exists.",
  "frontend/src/echoshift/screens/LobbyScreen.tsx": "Lobby showing players, host status, and start-game controls with validation for player count.",
  "frontend/src/echoshift/screens/ResultsScreen.tsx": "Results view calculating scores for Anchor and others, displaying outcomes and offering a play-again action.",
  "frontend/src/echoshift/screens/TopicSelectionScreen.tsx": "Topic voting screen showing generated topics, vote counts, a countdown timer, and handling topic selection.",
  "frontend/src/echoshift/state/session.ts": "Zustand store managing session state such as player identity, room, host status, and current screen with persistence.",
  "frontend/src/hooks/useActor.ts": "Hook creating a backend actor tied to Internet Identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and provider handling Internet Identity auth flow, stored identities, and login/logout state.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive CSS custom properties for light/dark themes, applying global background, text, and border styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and an Internet Identity provider, then renders App with global styles.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, custom colors from CSS variables, extended theme settings, and plugins for typography, container queries, and animations.",
  "project_state.json": "Stores the project’s state, feature requirements, and architectural notes for building the EchoShift MVP."
}