{
  "backend/main.mo": "Motoko backend actor managing rooms, players, chat messages, and phase transitions with create, join, start game, get state, and send message methods.",
  "feature_evidence.json": "Feature evidence report listing implemented features, associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for various frontend source files.",
  "frontend/index.css": "Tailwind base styles and theme variables defining OKLCH color tokens for light and dark modes.",
  "frontend/index.html": "HTML entry file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root React component handling screen routing and automatic phase-based transitions using room state polling.",
  "frontend/src/echoshift/api/useCreateRoom.ts": "React Query mutation for creating rooms with generated codes and updating session state.",
  "frontend/src/echoshift/api/useJoinRoom.ts": "React Query mutation for joining an existing room with error handling and session updates.",
  "frontend/src/echoshift/api/useRoomState.ts": "Polling hook that fetches room state every 2 seconds using React Query.",
  "frontend/src/echoshift/api/useSendMessage.ts": "Mutation hook for sending chat messages and refreshing room state.",
  "frontend/src/echoshift/api/useStartGame.ts": "Mutation hook for starting the game, validating host, and triggering state refresh.",
  "frontend/src/echoshift/components/AppHeader.tsx": "Header component showing title, subtitle, username badge, and room code.",
  "frontend/src/echoshift/components/ChatComposer.tsx": "Chat input component with validation and send button for submitting messages.",
  "frontend/src/echoshift/components/ChatMessageList.tsx": "Renders a scrollable chat message list, auto-scrolls to bottom, and styles messages based on sender.",
  "frontend/src/echoshift/components/ErrorBanner.tsx": "Displays a styled destructive alert with an optional title and error message.",
  "frontend/src/echoshift/components/ScreenLayout.tsx": "Provides a page layout wrapper with a gradient background and a fixed footer.",
  "frontend/src/echoshift/identity/playerId.ts": "Generates a unique player ID and stores/retrieves it from localStorage.",
  "frontend/src/echoshift/identity/useLocalUsername.ts": "Ensures a username exists via state, generating one if missing, and provides a reset function.",
  "frontend/src/echoshift/identity/username.ts": "Generates random adjective-animal-number usernames and validates them against a naming pattern.",
  "frontend/src/echoshift/screens/GameChatScreen.tsx": "Shows the in-game chat UI, personality instructions, and handles sending chat messages.",
  "frontend/src/echoshift/screens/GuessingScreen.tsx": "Displays the guessing phase with different messages for anchor vs. non-anchor players.",
  "frontend/src/echoshift/screens/HomeScreen.tsx": "Home lobby where users view/change their username and create or join rooms.",
  "frontend/src/echoshift/screens/LobbyScreen.tsx": "Shows lobby status, player list, host controls, and start-game conditions.",
  "frontend/src/echoshift/screens/ResultsScreen.tsx": "Displays anchor and weird players with their traits and offers a return-home action.",
  "frontend/src/echoshift/state/session.ts": "Zustand store managing player/session data with persistence and reset logic.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor using React Query, and refreshes dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hooks to manage Internet Identity authentication, including loading, login, logout, and identity state.",
  "frontend/src/index.css": "Defines Tailwind base styles and OKLCH color variables for light and dark themes with global styling rules.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, animations, and theme extensions using CSS variables.",
  "project_state.json": "Tracks project metadata, MVP goals, existing features, and architectural notes for the EchoShift app."
}