{
  "backend/main.mo": "Defines the game canister with room management, player handling, chat, and game start logic including Anchor assignment and phases.",
  "backend/migration.mo": "Migrates old room state structures to new list‑based formats by converting arrays into lists.",
  "feature_evidence.json": "Empty feature evidence report placeholder with no listed features.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for all frontend source files.",
  "frontend/index.css": "Tailwind base styles defining global color variables and light/dark theme tokens.",
  "frontend/index.html": "Root HTML file loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Main React component controlling screen routing based on session state and backend room phase.",
  "frontend/src/echoshift/api/useCreateRoom.ts": "React Query mutation for creating rooms and updating session state.",
  "frontend/src/echoshift/api/useJoinRoom.ts": "React Query mutation for joining rooms with error handling.",
  "frontend/src/echoshift/api/useRoomState.ts": "Polling hook that retrieves room state every 2 seconds.",
  "frontend/src/echoshift/api/useSendMessage.ts": "Mutation for sending chat messages with optimistic refresh.",
  "frontend/src/echoshift/api/useStartGame.ts": "Mutation for starting the game with host validation and phase updates.",
  "frontend/src/echoshift/components/AppHeader.tsx": "Header component showing title, optional subtitle, username badge, and room code.",
  "frontend/src/echoshift/components/ChatComposer.tsx": "Chat input form with validation and submit handling.",
  "frontend/src/echoshift/components/ChatMessageList.tsx": "Scrollable chat list with auto‑scrolling, timestamps, and sender styling.",
  "frontend/src/echoshift/components/ErrorBanner.tsx": "Reusable alert component for displaying error messages.",
  "frontend/src/echoshift/components/ScreenLayout.tsx": "Layout wrapper with gradient background and fixed footer linking to caffeine.ai.",
  "frontend/src/echoshift/identity/playerId.ts": "Generates a unique player ID and persists it in localStorage.",
  "frontend/src/echoshift/identity/useLocalUsername.ts": "React hook that ensures a generated username exists and allows resetting it.",
  "frontend/src/echoshift/identity/username.ts": "Generates adjective-animal-number usernames and validates them with a regex.",
  "frontend/src/echoshift/screens/GameChatScreen.tsx": "Displays the in-game chat UI with role info, messages, and composer tied to room state.",
  "frontend/src/echoshift/screens/GuessingScreen.tsx": "Shows the guessing phase UI, with different alerts for Anchor and non-Anchor players.",
  "frontend/src/echoshift/screens/HomeScreen.tsx": "Home screen for setting username, creating a room, or joining via room code.",
  "frontend/src/echoshift/screens/LobbyScreen.tsx": "Lobby interface showing players, host controls, and start‑game conditions.",
  "frontend/src/echoshift/screens/ResultsScreen.tsx": "Displays final game results, listing the Anchor and weird players with traits.",
  "frontend/src/echoshift/state/session.ts": "Zustand store managing session data such as player ID, username, room, host state, and screen.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and refreshes queries on identity change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication using AuthClient, including login, logout, and identity state.",
  "frontend/src/index.css": "Defines Tailwind base styles and CSS variables for light and dark themes, applying global background and text colors.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and the InternetIdentityProvider before rendering App.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, animations, container settings, and plugins.",
  "project_state.json": "Describes project metadata, architectural notes, existing features, and scope for the EchoShift MVP."
}