{
  "backend/main.mo": "Defines the game canister with room management, player handling including new role field, chatting, and game phase transitions.",
  "backend/migration.mo": "Migration logic that upgrades stored room/player data by adding an empty role field to each player.",
  "feature_evidence.json": "Feature evidence describing required updates for frontend/backend type bindings to support the new player role field.",
  "frontend-file-summaries.txt": "Text file listing high-level summaries of all frontend source files for reference.",
  "frontend/index.css": "Global Tailwind-based style definitions including color variables and dark mode overrides.",
  "frontend/index.html": "App entry HTML file mounting the React application and loading main.tsx.",
  "frontend/src/App.tsx": "Main React component routing between game screens based on session and backend phase state.",
  "frontend/src/echoshift/api/useCreateRoom.ts": "React Query mutation hook to create a new room and update session state.",
  "frontend/src/echoshift/api/useJoinRoom.ts": "Mutation hook for joining rooms with error handling for invalid or full rooms.",
  "frontend/src/echoshift/api/useRoomState.ts": "Polling query hook that fetches and returns the latest backend room state.",
  "frontend/src/echoshift/api/useSendMessage.ts": "Mutation hook for sending chat messages and invalidating room state cache.",
  "frontend/src/echoshift/api/useStartGame.ts": "Mutation hook for starting the game and handling host-only or player-count errors.",
  "frontend/src/echoshift/components/AppHeader.tsx": "Header component showing title, optional subtitle, username, and room code badge.",
  "frontend/src/echoshift/components/ChatComposer.tsx": "Chat input form with validation and submit handling for sending messages.",
  "frontend/src/echoshift/components/ChatMessageList.tsx": "Scrollable message list that formats timestamps and visually distinguishes the sender.",
  "frontend/src/echoshift/components/ErrorBanner.tsx": "Displays a styled destructive alert with a title and message.",
  "frontend/src/echoshift/components/ScreenLayout.tsx": "Provides a page layout with gradient background and a footer including a caffeine.ai link.",
  "frontend/src/echoshift/identity/playerId.ts": "Generates a unique player ID and stores/retrieves it from localStorage.",
  "frontend/src/echoshift/identity/useLocalUsername.ts": "React hook that generates and manages a local username through session state.",
  "frontend/src/echoshift/identity/username.ts": "Generates adjective-animal-number usernames and validates their format.",
  "frontend/src/echoshift/screens/GameChatScreen.tsx": "Chat screen showing role instructions, messages, and a composer for sending chat.",
  "frontend/src/echoshift/screens/GuessingScreen.tsx": "Displays guessing-phase UI with different alerts for anchor vs non-anchor players.",
  "frontend/src/echoshift/screens/HomeScreen.tsx": "Home screen enabling username generation, room creation, and joining via room code.",
  "frontend/src/echoshift/screens/LobbyScreen.tsx": "Lobby screen showing players, host controls, and start-game validation.",
  "frontend/src/echoshift/screens/ResultsScreen.tsx": "Results screen listing the anchor, weird players, and noting missing scoring features.",
  "frontend/src/echoshift/state/session.ts": "Zustand store managing player/session data with persistence for ID and username.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity login, stored identities, and login status using AuthClient.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom OKLCH color variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and the InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, animations, and container settings using CSS variables.",
  "project_state.json": "Describes the project's current state, goals, architecture notes, and implemented features for the EchoShift MVP."
}