{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "EchoShift MVP Frontend: Room-based multiplayer chat game UI with polling, anonymous identity, and game flow",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Create the base frontend app structure with Home, Lobby, Game Chat, Guessing, and Results screens and state-driven navigation flow (English only).",
      "acceptanceCriteria": [
        "User can navigate through Home → Lobby → Game Chat → Guessing → Results via app state transitions (not manual URL editing).",
        "Each screen has a clear title/header and primary actions appropriate to the phase (e.g., Create/Join, Start Game, Send Message, Submit Guess, Return/Home).",
        "All user-visible strings are English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "create",
          "description": "Create the main EchoShift app shell that renders exactly the required screens (Home/Lobby/Game Chat/Guessing/Results) using a state-driven flow derived from the active room state (and local session state), with consistent header/title areas and primary actions per phase."
        },
        {
          "path": "frontend/src/echoshift/state/session.ts",
          "operation": "create",
          "description": "Add a lightweight session/state module (e.g., context + hook) to hold local app flow state (active room code, player id, host flag, last error, screen focus) and to drive transitions without relying on manual URL editing."
        },
        {
          "path": "frontend/src/echoshift/screens/HomeScreen.tsx",
          "operation": "create",
          "description": "Implement the Home screen UI for Create Room / Join Room actions, wired to the session state so successful actions transition the app into Lobby."
        },
        {
          "path": "frontend/src/echoshift/screens/LobbyScreen.tsx",
          "operation": "create",
          "description": "Implement the Lobby screen UI: show room code, connected players, host controls area, and phase-aware actions that transition to the correct next screen based on polled room state."
        },
        {
          "path": "frontend/src/echoshift/screens/GameChatScreen.tsx",
          "operation": "create",
          "description": "Implement the Game Chat screen UI container (title, message list region, composer region) and wire it to the shared session/room state so it appears only during the chatting phase."
        },
        {
          "path": "frontend/src/echoshift/screens/GuessingScreen.tsx",
          "operation": "create",
          "description": "Implement the Guessing screen UI container to show guessing status and (for Anchor only) the selection + submit action; wire to room state to show only during the guessing phase."
        },
        {
          "path": "frontend/src/echoshift/screens/ResultsScreen.tsx",
          "operation": "create",
          "description": "Implement the Results screen UI container to display the outcome and reveal information provided by the room state; wire to room state to show only during results phase and provide a clear Return/Home action."
        },
        {
          "path": "frontend/src/echoshift/components/AppHeader.tsx",
          "operation": "create",
          "description": "Create a shared header component (title + optional room/username/status) used across all screens to enforce consistent navigation flow cues and English-only labeling. Use shadcn-ui primitives (e.g., Button/Badge) where appropriate; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Implement anonymous client-side username generation (AdjectiveAnimalNumber) with local persistence and an explicit reset option.",
      "acceptanceCriteria": [
        "Creating/joining a room auto-assigns a username if none exists.",
        "Username matches the pattern WordWordDigits (example provided) and is shown in Lobby and Chat.",
        "A page refresh preserves the same username for the same browser session/device."
      ],
      "file_operations": [
        {
          "path": "frontend/src/echoshift/identity/username.ts",
          "operation": "create",
          "description": "Add a username generator that produces AdjectiveAnimalNumber (e.g., BlueTiger42) and utilities to validate the pattern and to regenerate on explicit user request."
        },
        {
          "path": "frontend/src/echoshift/identity/useLocalUsername.ts",
          "operation": "create",
          "description": "Create a hook that loads/saves the generated username to localStorage, auto-creates one if missing, and exposes a reset method that regenerates and persists a new username."
        },
        {
          "path": "frontend/src/echoshift/identity/playerId.ts",
          "operation": "create",
          "description": "Add a client-side playerId generator/persistence utility (e.g., random UUID stored locally) so the frontend can consistently identify the same player across refreshes without login."
        },
        {
          "path": "frontend/src/echoshift/screens/HomeScreen.tsx",
          "operation": "modify",
          "description": "Wire the local username hook into Create/Join flows so a username is guaranteed before attempting room actions, show the current username, and provide an explicit Reset Username action (English strings only). Use shadcn-ui components (e.g., Card/Input/Button/Alert) for consistent UI; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/echoshift/screens/LobbyScreen.tsx",
          "operation": "modify",
          "description": "Display the local anonymous username in the Lobby and ensure it is used in any room-related calls. Use shadcn-ui primitives where appropriate; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/echoshift/screens/GameChatScreen.tsx",
          "operation": "modify",
          "description": "Ensure chat composer uses the persisted anonymous username when sending messages, and display it in the chat UI (English-only labels). Use shadcn-ui primitives where appropriate; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Provide near-real-time multiplayer updates via client-side polling using React Query refetch intervals, with reduced polling when inactive.",
      "acceptanceCriteria": [
        "Lobby player list updates on other clients within a short polling interval (e.g., ~1–2s) without manual refresh.",
        "Chat messages sent by one client appear on other clients within the polling interval.",
        "Polling is paused or reduced when the user is not in an active room/game screen to avoid unnecessary load."
      ],
      "file_operations": [
        {
          "path": "frontend/src/echoshift/api/useRoomState.ts",
          "operation": "create",
          "description": "Create a React Query hook that reads room state from the backend actor and polls at ~1–2s while the user is in an active room screen (Lobby/Game Chat/Guessing/Results), and pauses/reduces polling on Home or when no active room is set."
        },
        {
          "path": "frontend/src/echoshift/api/useChatMessages.ts",
          "operation": "create",
          "description": "Create a React Query hook for chat messages polling that derives messages from the current room state (or from a dedicated backend call if available in the generated actor), and configures refetch intervals consistent with the active phase."
        },
        {
          "path": "frontend/src/echoshift/state/session.ts",
          "operation": "modify",
          "description": "Add a notion of 'active screen/phase' (and/or window focus) to drive polling enablement and refetch intervals so polling is reduced when inactive."
        },
        {
          "path": "frontend/src/echoshift/screens/LobbyScreen.tsx",
          "operation": "modify",
          "description": "Use the polling room-state hook to render the player list and phase transitions; ensure UI updates without manual refresh. Use shadcn-ui components (e.g., Card/Badge/Separator) for list presentation; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/echoshift/screens/GameChatScreen.tsx",
          "operation": "modify",
          "description": "Use the polling messages hook to keep the message list updated and show new messages from other players within the polling interval. Use shadcn-ui components (e.g., ScrollArea/Card) if available to support scrolling UI; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Implement the chat phase UI: scrolling message list and message input, with optimistic send behavior and chronological ordering.",
      "acceptanceCriteria": [
        "Users in the Game Chat screen can send a message and see it appear in their local timeline immediately (optimistic UI acceptable) and persist via backend.",
        "Other players see new messages via polling updates.",
        "Messages are attributed to the correct anonymous username and shown in chronological order."
      ],
      "file_operations": [
        {
          "path": "frontend/src/echoshift/api/useSendMessage.ts",
          "operation": "create",
          "description": "Add a React Query mutation hook to send a chat message through the backend actor and update/optimistically append to the cached chat timeline for fast local feedback."
        },
        {
          "path": "frontend/src/echoshift/components/ChatMessageList.tsx",
          "operation": "create",
          "description": "Create a scrolling message list component that renders messages in chronological order with sender name and a readable timestamp/relative time (English), and auto-scroll behavior appropriate for chat. Use shadcn-ui primitives (e.g., Card/Separator) to keep styling consistent; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/echoshift/components/ChatComposer.tsx",
          "operation": "create",
          "description": "Create a chat composer component (input + Send button) with basic validation (non-empty, reasonable length), disabled state when not allowed, and wires to the send-message mutation. Use shadcn-ui Input/Button for consistent controls; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/echoshift/screens/GameChatScreen.tsx",
          "operation": "modify",
          "description": "Wire ChatMessageList + ChatComposer into the Game Chat screen, sourced from polled messages/room state, ensuring attribution uses the persisted anonymous username."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Implement guessing and results UI flow: Anchor-only guess submission, phase transition awareness, and results reveal presentation.",
      "acceptanceCriteria": [
        "Only the Anchor can submit the guess; non-Anchor players can view the guessing status but cannot submit.",
        "Submitting a guess transitions the room/game into Results state for all players.",
        "Results reveal: Anchor identity, each non-Anchor player’s Personality Card, guessed player, and correctness."
      ],
      "file_operations": [
        {
          "path": "frontend/src/echoshift/api/useStartGame.ts",
          "operation": "create",
          "description": "Add a React Query mutation hook for the host 'start game' action, updating cached room state and enabling the state-driven transition into the chat phase once the polled phase changes."
        },
        {
          "path": "frontend/src/echoshift/api/useSubmitGuess.ts",
          "operation": "create",
          "description": "Add a React Query mutation hook for Anchor guess submission (if/when the generated actor exposes the capability). If the capability is not available yet, implement a frontend stub that disables the submit UI and surfaces a clear English message indicating the action is not available."
        },
        {
          "path": "frontend/src/echoshift/screens/GuessingScreen.tsx",
          "operation": "modify",
          "description": "Render the player selection UI, enforce Anchor-only submission in the UI (non-Anchor sees status-only), and wire submit to the guess mutation. Use shadcn-ui components (e.g., Card/Button/RadioGroup/Select if available) for the selection UI; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/echoshift/screens/ResultsScreen.tsx",
          "operation": "modify",
          "description": "Render results reveal using room state (Anchor identity, cards, guess, correctness) with clear English labeling and consistent card-based layout. Use shadcn-ui Card/Badge components for reveal sections; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Ensure app-level flow mapping from room phase → screen (waiting→Lobby, chatting→Game Chat, guessing→Guessing, results→Results) so all players transition automatically based on polled state rather than manual URL changes."
        }
      ]
    },
    {
      "id": "REQ-8",
      "summary": "Apply a modern, clean, minimal, mobile-responsive visual theme with rounded cards, clean typography, and a coherent non-blue/purple palette.",
      "acceptanceCriteria": [
        "All screens are usable on mobile widths (e.g., 360px) without horizontal scrolling.",
        "Cards, inputs, and buttons have consistent rounded styling and typography.",
        "Color palette avoids the default blue/purple theme unless explicitly requested (not requested here)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "create",
          "description": "Create global Tailwind entry + CSS variables for the app theme (non-blue/purple palette), and establish consistent base typography, surfaces, and rounded card feel using the existing Tailwind/shadcn token approach."
        },
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "Adjust/extend Tailwind theme tokens only as needed to support the chosen non-blue/purple palette and consistent elevations/radii, keeping the design minimal and coherent."
        },
        {
          "path": "frontend/src/echoshift/components/ScreenLayout.tsx",
          "operation": "create",
          "description": "Create a reusable screen layout wrapper that enforces responsive max widths, spacing, and consistent card sections across all screens. Use shadcn-ui Card component(s) to standardize surfaces; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/echoshift/screens/HomeScreen.tsx",
          "operation": "modify",
          "description": "Apply the shared ScreenLayout and consistent shadcn-ui-based card/button/input styling for mobile-first layout; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/echoshift/screens/LobbyScreen.tsx",
          "operation": "modify",
          "description": "Apply the shared ScreenLayout and consistent shadcn-ui-based card/list styling for mobile-first layout; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/echoshift/screens/GameChatScreen.tsx",
          "operation": "modify",
          "description": "Apply the shared ScreenLayout and ensure the chat region is responsive with no horizontal scrolling at ~360px widths; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/echoshift/screens/GuessingScreen.tsx",
          "operation": "modify",
          "description": "Apply the shared ScreenLayout and consistent control styling for mobile-first layout; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/echoshift/screens/ResultsScreen.tsx",
          "operation": "modify",
          "description": "Apply the shared ScreenLayout and consistent reveal card styling for mobile-first layout; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-9",
      "summary": "Add UX guardrails and validation: show clear English errors, disable/hide actions when not allowed, and handle invalid/capacity/phase constraints in the UI.",
      "acceptanceCriteria": [
        "UI displays actionable error messages in English for invalid room and capacity/phase errors.",
        "Backend enforces 3–6 player constraints and phase restrictions even if UI is bypassed.",
        "Buttons are disabled or hidden when actions are not permitted (e.g., Start Game visible to host only)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/echoshift/components/ErrorBanner.tsx",
          "operation": "create",
          "description": "Create a reusable error display component for actionable English error messages (e.g., invalid room code, room full, not host, wrong phase). Use shadcn-ui Alert component (or equivalent) for consistent styling; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/echoshift/api/errors.ts",
          "operation": "create",
          "description": "Add a small utility to normalize backend call failures into user-friendly English messages (e.g., invalid room code, full room >6, start requires 3–6, action not allowed in current phase)."
        },
        {
          "path": "frontend/src/echoshift/screens/HomeScreen.tsx",
          "operation": "modify",
          "description": "Validate room code input (non-empty, expected format/length if applicable), show clear English errors from join failures, and prevent duplicate submissions. Use shadcn-ui Input/Button/Alert patterns; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/echoshift/screens/LobbyScreen.tsx",
          "operation": "modify",
          "description": "Disable/hide Start Game unless current player is host, and show clear English messaging when player count is <3 or >6; also gate other actions based on phase. Use shadcn-ui Button/Tooltip/Alert as appropriate; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/echoshift/screens/GameChatScreen.tsx",
          "operation": "modify",
          "description": "Disable chat composer and show a clear English message when chat is not allowed for the current phase (e.g., before game starts). Use shadcn-ui Alert for messaging; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/echoshift/screens/GuessingScreen.tsx",
          "operation": "modify",
          "description": "Enforce UI guardrails so only Anchor sees the enabled submit control, and non-Anchor users see guessing status-only messaging in English. Use shadcn-ui components for consistent presentation; verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}